In [ ]:
'''
Assignment to complete for machine learning 

Make an excel file
10 records 
2 columns
Job to do
Step 1: Load the file
Step 2: Fill all nullable with values
Step 3: Print only age,all rows
Step 4: Print all persons name with age more than 30
Step 5:	Save all person information whose age is 30 in a different file.
'''

In [1]:
import pandas as pd

In [50]:
address = pd.read_csv("self_data.csv")

In [51]:
address.describe()

             Age
count   8.000000
mean   56.375000
std    17.087485
min    33.000000
25%    43.750000
50%    55.500000
75%    68.750000
max    77.000000

In [52]:
address

      Name   Age
0    Lalit  33.0
1    Mohit  43.0
2    Rohit  45.0
3    Rockt   NaN
4    Lucky  44.0
5     Yash   NaN
6  Saurabh  66.0
7      Mnu  77.0
8   Sushil  77.0
9  Rishabh  66.0

In [53]:
address.fillna(50,inplace=True)

In [54]:
address

      Name   Age
0    Lalit  33.0
1    Mohit  43.0
2    Rohit  45.0
3    Rockt  50.0
4    Lucky  44.0
5     Yash  50.0
6  Saurabh  66.0
7      Mnu  77.0
8   Sushil  77.0
9  Rishabh  66.0

In [55]:
var1 =address.Age

In [56]:
var1

0    33.0
1    43.0
2    45.0
3    50.0
4    44.0
5    50.0
6    66.0
7    77.0
8    77.0
9    66.0
Name: Age, dtype: float64

In [59]:
var2=address.Name

In [60]:
var2

0      Lalit
1      Mohit
2      Rohit
3      Rockt
4      Lucky
5       Yash
6    Saurabh
7        Mnu
8     Sushil
9    Rishabh
Name: Name, dtype: object

In [61]:
var2[var1>50]

6    Saurabh
7        Mnu
8     Sushil
9    Rishabh
Name: Name, dtype: object

In [62]:
var2 = pd.write_csv("my.csv")

AttributeError: module 'pandas' has no attribute 'write_csv'

#  Sir's Method

In [10]:
import pandas as pd
df = pd.read_csv('self_data.csv')
print(df.head())

    Name   Age
0  Lalit  33.0
1  Mohit  43.0
2  Rohit  45.0
3  Rockt   NaN
4  Lucky  44.0

In [11]:
df.fillna(0)

      Name   Age
0    Lalit  33.0
1    Mohit  43.0
2    Rohit  45.0
3    Rockt   0.0
4    Lucky  44.0
5     Yash   0.0
6  Saurabh  66.0
7      Mnu  77.0
8   Sushil  77.0
9  Rishabh  66.0

In [12]:
print(df.head(8))

      Name   Age
0    Lalit  33.0
1    Mohit  43.0
2    Rohit  45.0
3    Rockt   NaN
4    Lucky  44.0
5     Yash   NaN
6  Saurabh  66.0
7      Mnu  77.0

In [13]:
m = df['Age']

In [14]:
import numpy as np
n= np.where(m>30)

In [15]:
x = np.array(df)

In [16]:
x=x[n]

In [17]:
print(x)

[['Lalit' 33.0]
 ['Mohit' 43.0]
 ['Rohit' 45.0]
 ['Lucky' 44.0]
 ['Saurabh' 66.0]
 ['Mnu' 77.0]
 ['Sushil' 77.0]
 ['Rishabh' 66.0]]

In [18]:
df1=pd.DataFrame(x)
df1.to_csv('my.csv')